{
  "welcome_message": "Welcome to my Portfolio!",
  "portfolio_description": "Discover various projects I've developed. From mobile apps to web services!",
  "projects": "Projects",
  "about": "About",
  "contact": "Contact",
  "trending_projects": "Trending Projects",
  "all_projects": "All Projects",
  "view_all": "View All",
  "project_description": "A project built with innovative technology and creative ideas.",
  "trending_project_description": "Currently trending project",
  "hero_title": "Creative Developer, Mincheol Shin",
  "hero_subtitle": "Prioritizing user experience, I develop innovative mobile apps and web services. Specializing in Flutter and React, always embracing new technologies.",
  "view_projects": "View Projects",
  "contact_me": "Contact Me",
  "experience": "Experience",
  "experience_title": "Experience",
  "experience_subtitle": "Introducing development experience and achievements from various companies.",
  "company_iclo": "ICLO",
  "company_villagebaby": "VillageBaby",
  "position_software_engineer": "Software Engineer",
  "position_mobile_developer": "Mobile App Developer",
  "iclo_description": "Development and maintenance of HomeDen and HomeDen Connect services",
  "villagebaby_description": "BabyBilly app development and maintenance",
  "experience_desc_1": "Responsible for cross-platform mobile app development using Flutter and backend construction using Firebase.",
  "experience_desc_2": "Developed mobile apps with React Native and built API servers based on Node.js.",
  "experience_desc_3": "Developed responsive web applications using React and TypeScript.",
  "projects_subtitle": "Check out the main projects I've developed.",
  "project_desc_1": "A full-featured e-commerce app supporting payment systems and real-time notifications.",
  "project_desc_2": "A task management tool for team collaboration, providing real-time sync and notification features.",
  "project_desc_3": "A weather app using OpenWeather API, providing clean UI and location-based services.",
  "opensource": "Open Source",
  "opensource_subtitle": "Growing together with the community through open source contributions.",
  "opensource_desc_1": "A reusable UI component library for Flutter developers.",
  "opensource_desc_2": "A collection of custom hooks and utility components for React development.",
  "opensource_desc_3": "A collection of boilerplate code and middleware for Node.js API development.",
  "opensource_desc_4": "A CSS framework and component guide for consistent design systems.",
  "role_planning_development": "Planning & Development",
  "team_solo": "Solo",
  "team_wallabity": "Wallabity Team",
  "team_sigongan": "Sigongan Team",
  "status_maintained": "Maintained",
  "status_in_progress": "In Progress",
  "status_completed": "Completed",
  "status_discontinued": "Discontinued",
  "contribution_percent": "Contribution {}%",
  "app_development": "App Development",
  "present": "Present",
      "project_auto_shot_desc": "An app that makes automatic screen capture easy on macOS. Set the number of captures and intervals, then it runs in the background automatically. Focus on your work while Auto Shot handles screenshots automatically.",
    "project_auto_shot_desc_detail": "Auto Shot originated from the same problem awareness as Key Snap, conceived while separating the two functions of an existing app into independent applications. The core functionality is to automatically capture screens at set intervals, and the development process itself proceeded without major difficulties.\n\nHowever, this project leaves me with some regret as I haven't yet implemented the feature to automatically capture only specific regions of selected screens or windows due to technical limitations. Rather than simply cropping after capture, I'm aiming for functionality that accurately captures pre-designated areas. I'm still maintaining and working on this challenging and meaningful task that continues to stimulate my desire to overcome technical challenges.\n\nThere was also an unexpected response. A teacher from the University of Bayreuth in Germany requested an educational license, and after much consideration, I converted the paid policy to free. When I later received sincere thanks and heartfelt feedback, I was deeply moved by the fact that an app I created actually helped someone far away. This experience rekindled my passion for development.",
  "project_enko_desc": "A macOS app that instantly converts mistyped English text into correct Korean. When typing Korean with an English keyboard, get Hangul output without extra steps.",
  "project_enko_desc_detail": "Enko started as a project requested by a friend, developed to resolve the inconvenience of intending to type in Korean but having the keyboard set to English, resulting in unintended input. While similar apps existed on the App Store, most used a method of copying converted Korean to the clipboard, which I judged had room for improvement in terms of user experience.\n\nThe biggest concern was the logic for accurately converting English input to Korean and how to input the converted text. Among various methods, I implemented a solution that handles both translation and pasting simultaneously with a single shortcut, making it a more practical and intuitive tool.\n\nThere's a behind-the-scenes story to this project: after completing development and delivering the app to the friend who requested it, I still haven't received feedback yet! 😊",
  
  "project_dwr_desc": "An app that provides smart hydration reminders in the macOS menu bar. Set customizable intervals for water drinking reminders, track daily and monthly hydration statistics, and visually check goal achievement rates.",
  "project_dwr_desc_detail": "DWR started purely from my own personal need. While there are countless water reminder apps available, it's difficult to focus on specific alerts on smartphones due to the sheer volume of various notifications. Since I spend most of my time in front of a computer, I decided to create a simple, highly focused water reminder app exclusively for macOS.\n\nThe aspect I struggled with most during development was the unit conversion UX. Initially, I implemented it so that when users changed units, the numerical values would automatically convert as well. However, judging that this could confuse users, I modified it so that only the unit changes while keeping the numerical values intact. While the functionality itself is simple, this was a project where I thought deeply about and carefully designed the user experience.\n\nAfter completion, I recommended it to friends who work in front of MacBooks, and received a lot of positive feedback saying it was practical and easy to use without being burdensome. I also use this application daily myself, and the experience of creating a small but helpful tool for everyday life felt precious to me.",
  
  "project_ring_timer_desc": "A cute timer you won't find anywhere else! A timer app that helps you manage time efficiently with Wallaby. Features intuitive UI and various customization options at a glance.",
  "project_ring_timer_desc_detail": "Ring Timer is the first collaborative project I undertook by forming team Wallavity with a designer colleague from my company. We planned to create a timer app that goes beyond a simple Pomodoro timer and isn't boring design-wise, starting development with a focus on UI/UX that provides users with an immersive experience.\n\nThe most challenging part of the development process was implementing the timer interaction that allows users to adjust time through touch. To complete this feature, I studied mathematical principles such as circular coordinates and angle calculations again to design the logic, and eventually managed to implement it the way we wanted.\n\nCurrently, over 500 users are using the app, and we continue ongoing maintenance based on feedback received directly from users. Although the scale is small, it holds special affection for me as it's both the starting point of collaboration and the first project directly connected with users.",
  
  "project_thumbnail_maker_desc": "An app for easily and conveniently creating blog and video thumbnails. Create beautiful thumbnails with various templates and photo effects. Offers features like free text placement and saturation/brightness adjustment.",
  "project_thumbnail_maker_desc_detail": "Thumbnail Maker started as a project to directly solve the inconvenience I felt while creating thumbnails during my time running a Naver blog. At the time, most available thumbnail creation tools were either paid or didn't provide the features I wanted, so I proposed the idea directly to my team, and fortunately it was adopted and I got to develop it.\n\nThis app is a tool that helps users easily create thumbnails by adding text, shapes, effects, etc. based on a single image. I implemented the functionality using a screenshot-based capture method so users can check and save their creations.\n\nCurrently, I don't use it personally very often since I stopped running my blog, but it's still a beloved project with loyal users who consistently find and use it.",
  
  "project_sudoku_desc": "A Sudoku game you can enjoy without network connection. Train your brain by playing puzzle games with Wallaby. Suitable for beginners to experts, and you can play with focus alongside white noise.",
  "project_sudoku_desc_detail": "This project started from a simple curiosity: \"How are Sudoku puzzles created?\" Another motivation was that while there are many Sudoku apps available, the abundance of ads makes it difficult to stay immersed in the game.\n\nFor puzzle generation, there were two approaches: real-time algorithm-based generation and pre-generation. I chose the pre-generation method so users could feel a sense of achievement by clearing problems step by step. I implemented the puzzle generation using Python and developed the game app with a structure that loads and provides these pre-generated puzzles.\n\nIt's a game project that can be enjoyed casually when needed, and it remains a service that I have fond memories of creating with enjoyment.",
  
      "project_key_snap_desc": "A powerful macOS app for fast and efficient screen capture with keyboard shortcuts. Capture full screen or specific windows with a single key press. Save screenshots instantly without internet connection or data collection.",
    "project_key_snap_desc_detail": "Key Snap wasn't born from a completely original idea. It was inspired by an existing automatic capture app that was already available. That app offered both automatic capture at regular intervals and keyboard shortcut capture functionality, but I thought separating these two features clearly would provide greater convenience to more users. I also believed that improving accessibility by making it easily searchable and installable on the App Store would provide real help to users performing related tasks.\n\nThe development process itself went smoothly, but unexpected issues arose during the release process. The App Store review rejected the app once due to my insufficient understanding of user access permission policies, and I had to redesign and reimplement the related functionality to resolve this. It was my first time experiencing such an issue, but it was a great opportunity to gain a deeper understanding of Apple's policies.\n\nAfter the project was completed, I introduced it on Product Hunt, and fortunately, it was selected as a featured app, receiving a lot of attention and feedback, making it a memorable project for me.",  
  "project_auto_shot_subtitle": "macOS Automatic Screenshot Capture Tool",
  "project_enko_subtitle": "Instantly Convert English Typos to Korean",
  "project_dwr_subtitle": "macOS Menu Bar Hydration Reminder App",
  "project_ring_timer_subtitle": "Exercise & Study Timer & Pomodoro",
  "project_thumbnail_maker_subtitle": "Blog & Video Thumbnail Creator",
  "project_sudoku_subtitle": "Classic Puzzle Game",
  "project_key_snap_subtitle": "macOS Screenshot App",
  "project_sorialbum_title": "Sorialbum",
  "project_sorialbum_subtitle": "AI Photo Description Service for the Visually Impaired",
  "project_sorialbum_desc": "An AI-powered gallery-style photo description service for the visually impaired. Provides everything from simple one-line captions to accurate and detailed descriptions by analyzing photos. Features voice guidance, keyword search, text extraction, and various accessibility functions.",
  "project_sorialbum_desc_detail": "Sorialbum is a project by a team that operates a photo description service for the visually impaired, which I came across by chance through a side project recruitment post. I was impressed by their problem definition and solution approach, so I applied and had the opportunity to join the project through an interview.\n\nIn the early stages of the project, I focused on refactoring to improve code readability and maintainability, enhancing the architecture and state/routing management logic. Later, I directly developed various features such as photo search, my page, admin dashboard, bookmarks, and event functions, contributing to enriching the user experience.\n\nWhat was particularly impressive was that the onboarding process first addressed understanding visual impairment. This allowed me to view problems not just as simple feature implementations, but from the perspective of actual users. Through the process of improving features based on various hypotheses, experiments, and feedback, I was able to directly experience a culture where both the team and product grow together.",
  
  "project_bible_bot_title": "Bible Bot",
  "project_bible_bot_subtitle": "Korea Bible University Intranet Mobile Service",
  "project_bible_bot_desc": "An intranet service available at Korea Bible University, providing a mobile app for school life convenience including meal information, chapel attendance, and class schedules. Developed to make the web-only intranet conveniently accessible on mobile.",
  "project_bible_bot_desc_detail": "Bible Bot originated from the inconvenience I felt during my university years due to the lack of a mobile app for the school's intranet. To address the discomfort of having to access only through the web, I decided to create an app service myself and planned a team project where I took charge of app development while studying Flutter. The team consisted of 1 server developer and 2 app developers, and this was my first app development experience.\n\nFrom studying to development and deployment, the entire process was a series of trial and error, but we were able to concentrate for a month to complete the app and launch the service. Later, we submitted it to an internal competition and won an award, and I felt great satisfaction seeing actual students using the app.\n\nThis project was my first encounter with Flutter and my first experience operating a service for real users, making it a deeply meaningful app for me. It was both my starting point as a developer and a precious project where I could confirm my own potential.",
  "team_bible_bot": "Bible Bot Team",
  "team_cozymakers": "CozyMakers Team",
  "project_greenmate_title": "GreenMate",
  "project_greenmate_subtitle": "AI Friend That Helps You Find Your True Self",
  "project_greenmate_desc": "A mental healthcare app that provides a special journey to understand and grow yourself with AI characters. Helps you find emotional stability and deeply understand yourself through emotion analysis and personalized challenges.",
  "project_greenmate_desc_detail": "GreenMate started from empathy for the social problem of depression. When I encountered the seriousness of depression not just through news but directly through a close friend, I felt a deeper understanding of its gravity and wanted to do something that could provide real help.\n\nDuring this time, I learned about a team developing an app service to help people experiencing depression and mental difficulties. Through meetings, I deeply empathized with the project's direction and values, and joined the team.\n\nCurrently, I'm working on refactoring the app, and as a core team member, I plan to participate in various activities including feature improvements, user feedback-based improvements, and related content expansion. I'm steadily contributing to this project to make it a sincere attempt to solve social problems through technology.",
  "development": "Development",
  "villagebaby_detailed_description": "Baby Billy – Pregnancy/parenting app development for couples (MAU 300k, DAU 70k)\n\n• Shopping service performance improvement\n  - Reduced main loading time from 5 seconds to under 1 second (lazy loading)\n  - Applied network image caching and lazy loading, reducing data usage to 1/50 level\n  - Applied MVVM and Repository patterns, transitioned state management from Provider to Riverpod\n\n• New community feature development\n  - Implemented comprehensive social features including post creation/editing, comments, photo uploads, bookmarks, blocking\n  - Developed keyword search functionality for content and community posts\n  - Introduced and implemented design system → Enhanced UI consistency and reusability\n\n• User-customized service development\n  - Country-specific features and multilingual support (Vietnam, Thailand, Indonesia, Japan, English)\n  - Developed automatic recommendation of 'Taedam' content for pregnant users and in-app push messages\n  - Designed and implemented UI components such as timeline, charts, date picker\n\n• Team leadership and collaboration system establishment\n  - Established team task allocation and code conventions\n  - Led organic communication with other teams (planning/design/marketing collaboration)",
  "iclo_detailed_description": "📱 HomeDen App Development (Flutter-based New Project)\n\n• End-to-end development from app planning to deployment based on clean architecture\n• Designed modular and stable state management structure using Riverpod\n• Developed national oral health examination application service and AI-based dental caries image screening functionality\n• Secured marketing features through Firebase push notifications and AppsFlyer deep link integration\n\n🔒 Server and Authentication Feature Development\n\n• Implemented member API and OAuth login (Google, Apple, Kakao) for user authentication\n• JWT-based access/refresh token handling",
  "service_babybilly": "BabyBilly",
  "service_homeden": "Homeden",
  "main_service": "Main Service"
}