{
  "welcome_message": "Welcome to my Portfolio!",
  "portfolio_description": "Discover various projects I've developed. From mobile apps to web services!",
  "projects": "Projects",
  "about": "About",
  "contact": "Contact",
  "trending_projects": "Trending Projects",
  "all_projects": "All Projects",
  "view_all": "View All",
  "project_description": "A project built with innovative technology and creative ideas.",
  "trending_project_description": "Currently trending project",
  "hero_title": "Creative Developer, Mincheol Shin",
  "hero_subtitle": "Prioritizing user experience, I develop innovative mobile apps and web services. Specializing in Flutter and React, always embracing new technologies.",
  "view_projects": "View Projects",
  "contact_me": "Contact Me",
  "experience": "Experience",
  "experience_title": "Experience",
  "experience_subtitle": "Introducing development experience and achievements from various companies.",
  "company_iclo": "ICLO",
  "company_villagebaby": "VillageBaby",
  "position_software_engineer": "Software Engineer",
  "position_mobile_developer": "Mobile App Developer",
  "iclo_description": "Development and maintenance of HomeDen and HomeDen Connect services",
  "villagebaby_description": "BabyBilly app development and maintenance",
  "experience_desc_1": "Responsible for cross-platform mobile app development using Flutter and backend construction using Firebase.",
  "experience_desc_2": "Developed mobile apps with React Native and built API servers based on Node.js.",
  "experience_desc_3": "Developed responsive web applications using React and TypeScript.",
  "projects_subtitle": "Check out the main projects I've developed.",
  "project_desc_1": "A full-featured e-commerce app supporting payment systems and real-time notifications.",
  "project_desc_2": "A task management tool for team collaboration, providing real-time sync and notification features.",
  "project_desc_3": "A weather app using OpenWeather API, providing clean UI and location-based services.",
  "opensource": "Open Source",
  "opensource_subtitle": "Growing together with the community through open source contributions.",
  "opensource_desc_1": "A reusable UI component library for Flutter developers.",
  "opensource_desc_2": "A collection of custom hooks and utility components for React development.",
  "opensource_desc_3": "A collection of boilerplate code and middleware for Node.js API development.",
  "opensource_desc_4": "A CSS framework and component guide for consistent design systems.",
  "role_planning_development": "Planning & Development",
  "team_solo": "Solo",
  "team_wallabity": "Wallabity Team",
  "status_maintained": "Maintained",
  "status_in_progress": "In Progress",
  "status_completed": "Completed",
  "status_discontinued": "Discontinued",
  "contribution_percent": "Contribution {}%",
  "app_development": "App Development",
  "present": "Present",
  "project_auto_shot_desc": "An app that makes automatic screen capture easy on macOS. Set the number of captures and intervals, then it runs in the background automatically. Focus on your work while Auto Shot handles screenshots automatically.",
  "project_enko_desc": "A macOS app that instantly converts mistyped English text into correct Korean. When typing Korean with an English keyboard, get Hangul output without extra steps.",
  "project_dwr_desc": "An app that provides smart hydration reminders in the macOS menu bar. Set customizable intervals for water drinking reminders, track daily and monthly hydration statistics, and visually check goal achievement rates.",
  "project_ring_timer_desc": "A cute timer you won't find anywhere else! A timer app that helps you manage time efficiently with Wallaby. Features intuitive UI and various customization options at a glance.",
  "project_thumbnail_maker_desc": "An app for easily and conveniently creating blog and video thumbnails. Create beautiful thumbnails with various templates and photo effects. Offers features like free text placement and saturation/brightness adjustment.",
  "project_sudoku_desc": "A Sudoku game you can enjoy without network connection. Train your brain by playing puzzle games with Wallaby. Suitable for beginners to experts, and you can play with focus alongside white noise.",
  "project_key_snap_desc": "A powerful macOS app for fast and efficient screen capture with keyboard shortcuts. Capture full screen or specific windows with a single key press. Save screenshots instantly without internet connection or data collection."
}